In [31]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [32]:
df=pd.read_csv("Position_Salaries.csv")

In [33]:
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [38]:
# now we split the data in to  dependend and the independent variable
x=df.iloc[:, :-1].values
y=df.iloc[:, 1].values

In [39]:
print(x)

[['Business Analyst' 1]
 ['Junior Consultant' 2]
 ['Senior Consultant' 3]
 ['Manager' 4]
 ['Country Manager' 5]
 ['Region Manager' 6]
 ['Partner' 7]
 ['Senior Partner' 8]
 ['C-level' 9]
 ['CEO' 10]]

In [36]:
# now we use the inhot encoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import StandardScaler
ct = ColumnTransformer(
    transformers=[
        ('encoder', OneHotEncoder(drop='first'), [3])
    ],
    remainder='passthrough'
)

In [43]:

print(x)

[['Business Analyst' 1]
 ['Junior Consultant' 2]
 ['Senior Consultant' 3]
 ['Manager' 4]
 ['Country Manager' 5]
 ['Region Manager' 6]
 ['Partner' 7]
 ['Senior Partner' 8]
 ['C-level' 9]
 ['CEO' 10]]

In [ ]:
print(x.shape)  # See how many columns your data actually has

(10, 2)

In [ ]:
df

            Position  Level   Salary
0   Business Analyst      1    45000
1  Junior Consultant      2    50000
2  Senior Consultant      3    60000
3            Manager      4    80000
4    Country Manager      5   110000
5     Region Manager      6   150000
6            Partner      7   200000
7     Senior Partner      8   300000
8            C-level      9   500000
9                CEO     10  1000000

In [ ]:
# Always check this first:
print("Data types:\n", df.dtypes)

# For DataFrames, use column NAMES not indices in ColumnTransformer

Data types:
 Position    object
Level        int64
Salary       int64
dtype: object

In [45]:
## now we split hte training and the testing data
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=1/3)
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(6, 2)
(4, 2)
(6,)
(4,)